trade_exp/src/Documents/НачислениеИСписаниеБонусныхБаллов/НачислениеИСписаниеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НачислениеИСписаниеБонусныхБаллов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПравилоНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МаркетинговоеМероприятие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8158662b-6a9a-4862-8b90-82fc42b89722">
    <name>Причина</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1337e572-00d6-47b1-8f0b-eb21595b97f2">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55fe50f5-ddbd-455c-9099-0f0bff057d44">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="959ca8c5-0d9a-4cc5-ab96-2fe00bd0ada9">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0d224d2c-ba57-4298-be05-ab8f3a7838ed">
    <name>ВидПравила</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a9e9e1c-9b67-434d-b6d2-112391d11cf1">
    <name>КомментарийВКарточкиПартнеров</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db7d6939-2cd5-4ee3-966e-75f50f11577f">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ff99f87-48f6-4cc0-8cc6-e248bfd00b83">
    <name>Утверждающий1</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7c188b1-fc86-45b4-a790-80c762a23fa5">
    <name>Утверждающий2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01d5fa18-87ef-47ab-8eeb-3f63e64ac0e9">
    <name>ИДЭлементаВБитриксе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="77ab5aa4-e2f0-4204-a0d2-19561758ca39">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисление</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачислитьЗаСчет</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/Альтерра_ИдентификаторыОбъектовБ24/Альтерра_ИдентификаторыОбъектовБ24.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee4a31c5-7fc2-4603-a3a6-a3b2f164e25f">
  <name>Альтерра_ИдентификаторыОбъектовБ24</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="563fa98d-8b10-47a9-b3b6-bbab0bed0c7c">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d9749d62-9a16-4082-891b-9c5ac00a2099">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/НачислениеИСписаниеБонусныхБаллов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы 

 &НаСервере
 Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	 
	ОтказПриЗаписи = Ложь;

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИспользоватьПериодДействия = 0;
		ИспользоватьОтсрочкуНачалаДействия = 1;
		Объект.КоличествоПериодовДействия = 0;
		Объект.КоличествоПериодовОтсрочкиНачалаДействия = 1;
		Объект.ПериодОтсрочкиНачалаДействия = Перечисления.Периодичность.День;
		
		ИзменитьДоступность(ЭтаФорма);
	КонецЕсли;
	
	ОтделАналитики = ДопМодуль.РольДоступнаОтделАналитики();   
	
	Элементы.ГруппаПравилоНачисления.ТолькоПросмотр  = Ложь;
	Элементы.МаркетинговоеМероприятие.ТолькоПросмотр = Ложь;
	Элементы._Причина.ТолькоПросмотр                 = Ложь; 
	
	Если  ЗначениеЗаполнено(Объект.Документ) Тогда  
		НастройкиВидимостиСОснованием(ОтделАналитики);
	КонецЕсли;
	
	Элементы._Причина.РедактированиеТекста = ОтделАналитики;
	
	Элементы._Причина.БыстрыйВыбор                 = Не ОтделАналитики;
	Элементы.Статус.ТолькоПросмотр                 = Не ОтделАналитики;
	Элементы.ГруппаСрокДействия.ТолькоПросмотр     = Не ОтделАналитики;
	Элементы.ГруппаОтсрочкаДействия.ТолькоПросмотр = Не ОтделАналитики;
	
	Если ЗначениеЗаполнено(Объект.ИДЭлементаВБитриксе) Тогда
		ИДЭлементаВБитриксеФ = Объект.ИДЭлементаВБитриксе;
	ИначеЕсли ЗначениеЗаполнено(ПолучитьИДЭлементаВБитриксе()) Тогда
		ИДЭлементаВБитриксеФ = ПолучитьИДЭлементаВБитриксе();
	Иначе
		ИДЭлементаВБитриксеФ = "";
	КонецЕсли;
	
	Элементы.Утверждающий1.ТолькоПросмотр = ЗначениеЗаполнено(ИДЭлементаВБитриксеФ);
	
	ИзменениеДоступностиФормыДляРедакрирования(); 
	Элементы.Утверждающий2.Подсказка = "Сотрудник, имеющий полномочия на согласование суммы от " + ДопМодуль.ПолучитьКонстанту_ДопустимаяСуммаУтвержденияББ() + " рублей"; 
	
	Элементы.НадписьНельзяРедактировать.Видимость = НЕ ЗначениеЗаполнено(ИДЭлементаВБитриксеФ);
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПеред(Отказ)
	
	Если Объект.ЗаСчет = Истина Тогда
	    Элементы.НачислитьЗаСчет.Видимость = Истина
	Иначе
		Элементы.НачислитьЗаСчет.Видимость = Ложь
	КонецЕсли; 	
		
	ДокументНовый = Не ЗначениеЗаполнено(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Док_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
  Если Объект.НачислитьЗаСчет.Количество() = 0 Тогда
	  Объект.ЗаСчет = Ложь;
	  Элементы.НачислитьЗаСчет.Видимость = Ложь
  КонецЕсли;  
	ДопЗаполнение(); 
	
КонецПроцедуры  


&НаСервере
Процедура Док_ПриЗаписиНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СообщениеОбОшибке = ДопМодуль.СуммаПревышаетДопустимую(Объект);	
	Если СообщениеОбОшибке <> "" Тогда
		Отказ = Истина; 
		ОтказПриЗаписи = Истина;
		Сообщить(СообщениеОбОшибке);
	КонецЕсли;	    
	
КонецПроцедуры


&НаКлиенте
Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(СокрЛП(Объект.КомментарийВКарточкиПартнеров)) И ДокументНовый Тогда
		Комментарий = Строка(Объект.ВидПравила) + " " + Строка(Объект.Дата) + ": " + СокрЛП(Объект.КомментарийВКарточкиПартнеров);
		Если Объект.ВидПравила = ПредопределенноеЗначение("Перечисление.ВидыПравилНачисленияБонусныхБаллов.Начисление") Тогда
			Для Каждого стрНачисление Из Объект.Начисление Цикл
				Если ЗначениеЗаполнено(стрНачисление.Партнер) Тогда
					ЗаписатьКомментарийВПартнераНаСервере(Комментарий + " (" + Строка(стрНачисление.Баллы) + " бб)", стрНачисление.Партнер);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Объект.ВидПравила = ПредопределенноеЗначение("Перечисление.ВидыПравилНачисленияБонусныхБаллов.Списание") Тогда
			Для Каждого стрСписание Из Объект.Списание Цикл
				Если ЗначениеЗаполнено(стрСписание.Партнер) Тогда
					ЗаписатьКомментарийВПартнераНаСервере(Комментарий + " (" + Строка(стрСписание.Баллы) + " бб)", стрСписание.Партнер);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ДокументНовый = Ложь;
	КонецЕсли;
		
	//Если НЕ Объект.ИДЭлементаВБитриксе = "" Тогда
	//	ОбновитьБП_Бонусы(); 
	//КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти  


#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура Док_СуммаДокументаПриИзмененииПосле(Элемент) 
	Док_СуммаДокументаПриИзмененииПослеНаСервере();	
КонецПроцедуры   

&НаСервере
Процедура Док_СуммаДокументаПриИзмененииПослеНаСервере() 
	
	СтрокаТаблицы = Неопределено;
	
	Если Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление  Тогда
		Если Объект.Начисление.Количество() > 0 Тогда
			СтрокаТаблицы = Объект.Начисление[0]; 
		КонецЕсли;
	ИначеЕсли Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Списание Тогда
		Если Объект.Списание.Количество() > 0 Тогда
			СтрокаТаблицы = Объект.Списание[0]; 
		КонецЕсли;
	КонецЕсли;  
	
	Если СтрокаТаблицы = Неопределено Тогда
		Сообщить("Табличная часть не заполнена!");
		Объект.СуммаДокумента = 0;
	Иначе 
		СтрокаТаблицы.Баллы = Объект.СуммаДокумента;
	КонецЕсли;
	
	
КонецПроцедуры

 &НаКлиенте
Процедура Док_ИспользоватьПравилоНачисленияРучноеНачислениеПриИзмененииПосле(Элемент)
	ОчиститьТаблицы(); 
КонецПроцедуры 

&НаКлиенте
Процедура Док_ИспользоватьПравилоНачисленияРучноеСписаниеПриИзмененииПосле(Элемент)
	ОчиститьТаблицы();  
    УстановитьПричинуСписание(); 
КонецПроцедуры  

&НаКлиенте
Процедура Док_ИспользоватьПравилоНачисленияПриИзмененииПосле(Элемент)
	ОчиститьТаблицы();
КонецПроцедуры

 &НаКлиенте
Процедура Док__ПричинаНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	Если НЕ ДопМодуль.РольДоступнаОтделАналитики()  Тогда  
		
		МассивЗначений = ПолучитьМассивПричинНачисления();
		ДанныеВыбора = МассивЗначений;	
		СтандартнаяОбработка = Ложь;
		НазваниеФормы = "Справочник.ПричиныНачисленияБонусныхБаллов.ФормаВыбора";
		ОткрытьФормуСОтбором(МассивЗначений, НазваниеФормы, Элемент); 
		
	КонецЕсли;  
	
КонецПроцедуры

 &НаКлиенте
Процедура Док__ПричинаОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	__Причина = ВыбранноеЗначение;
КонецПроцедуры  

 &НаКлиенте
 Процедура Док_ЗаСчетПриИзмененииПосле(Элемент)   
	 
	Если Объект.ЗаСчет = Ложь и Объект.НачислитьЗаСчет.Количество() = 0 Тогда
		Элементы.НачислитьЗаСчет.Видимость = Ложь
	Иначе 
		Элементы.НачислитьЗаСчет.Видимость = Истина;
		Объект.ЗаСчет = Истина
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура Док_Утверждающий1НачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДопУтверждение = Ложь;
	МассивЗначений = ДопМодуль.ПолучитьМассивУтверждающих(ДопУтверждение);
	НазваниеФормы = "Справочник.Сотрудники.ФормаВыбора";
	ДанныеВыбора = МассивЗначений;  
	СтандартнаяОбработка = Ложь; 
	ОткрытьФормуСОтбором(МассивЗначений, НазваниеФормы, Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура Док_Утверждающий1ОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Объект.Утверждающий1 = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_Утверждающий2НачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	Если ЗначениеЗаполнено(Объект.Утверждающий1) Тогда 
		ДопУтверждение = Истина;
		МассивЗначений = ДопМодуль.ПолучитьМассивУтверждающих(ДопУтверждение);
		НазваниеФормы = "Справочник.Сотрудники.ФормаВыбора";
		ДанныеВыбора = МассивЗначений;  
		ОткрытьФормуСОтбором(МассивЗначений, НазваниеФормы, Элемент);
		СтандартнаяОбработка = Ложь; 
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Док_Утверждающий2ОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
		Объект.Утверждающий2 = ВыбранноеЗначение;
		
КонецПроцедуры 

 

&НаСервере                  
Процедура Док__ДокументПриИзмененииПослеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Документ) И Объект.ссылка.Документ <> Объект.Документ Тогда 
		
			
		ОчиститьТаблицы();
		Объект.Комментарий = "";

		ОтделАналитики = ДопМодуль.РольДоступнаОтделАналитики(); 
		НастройкиВидимостиСОснованием(ОтделАналитики); 
		
		ДокОбъект = РеквизитФормыВЗначение("Объект"); 
		
		ТекстОшибки = ДокОбъект.ЗаполнитьДанныеПоОснованию(ДокОбъект.Документ); 
		Если НЕ ТекстОшибки = "" Тогда     
			ДокОбъект.Документ = Документы.ОбращениеКлиента.ПустаяСсылка();
			Сообщить(ТекстОшибки,СтатусСообщения.Важное);
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");	
		
		Элементы.ГруппаСписания.Видимость = Ложь;
		Элементы.ГруппаНачисления.Видимость = Истина; 
		Элементы.Начисления.Видимость = Истина;
		ВариантРучногоРасчета = 1;
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Документ) Тогда 
		
		ОчиститьТаблицы();
		Объект.Комментарий = "";	
		
	КонецЕсли;   
	
КонецПроцедуры  

&НаКлиенте
Процедура Док__ДокументПриИзмененииПосле(Элемент)
	Док__ДокументПриИзмененииПослеНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура  ОткрытьФормуСОтбором(МассивЗначений, НазваниеФормы, Элемент)
	
        Форма = ОткрытьФорму(НазваниеФормы,, Элемент);
		
		ОтборВладелец = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ОтборВладелец.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
		ОтборВладелец.Использование = Истина; 
		ОтборВладелец.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка"); 
		ОтборВладелец.ПравоеЗначение = МассивЗначений;      
	
КонецПроцедуры



#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыформыНачисления

&НаКлиенте
Процедура Док_НачисленияПередНачаломДобавленияПеред(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) 
	   
		Если Объект.Начисление.Количество()>= 1 Тогда 
			Отказ = Истина;	
		КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура Док_БонусныеБаллыПартнерПриИзмененииПосле(Элемент)
	ПересчитатьБаллыПоТекущейСтрокеНачисления();
КонецПроцедуры

// + Замена стандартного поиска по полю Партнер - на поиск по Коду
&НаКлиенте
Процедура Док_БонусныеБаллыПартнерАвтоПодборПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Не СтандартныйПоискПоПартнеру Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьДанныеВыбораРасширенные(Текст);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_БонусныеБаллыСуммаПриИзмененииПосле(Элемент) 	
	
	ПересчитатьБаллыПоТекущейСтрокеНачисления();   
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписания
	
&НаКлиенте
Процедура Док_СписанияПередНачаломДобавленияПеред(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
   
		Если Объект.Списание.Количество()>= 1 Тогда 
			Отказ = Истина;	
		КонецЕсли; 
		
КонецПроцедуры



 &НаКлиенте
Процедура Док_СписанияПартнерПриИзмененииПосле(Элемент)
	ПересчитатьБаллыПоТекущейСтрокеСписания(); 
	ПроверитьПартнера("Списание");	
КонецПроцедуры 

&НаКлиенте
Процедура Док_СписанияПартнерАвтоПодборПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Не СтандартныйПоискПоПартнеру Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьДанныеВыбораРасширенные(Текст);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_СписанияБаллыПриИзмененииПосле(Элемент)  
	
	ПересчитатьБаллыПоТекущейСтрокеСписания(); 
	
КонецПроцедуры

#КонецОбласти  

#Область ЗагрузкаИзФайла

&НаКлиенте
Процедура ЗагрузитьИзФайла_Альтерра(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы= Новый Структура();
	ПараметрыФормы.Вставить("НастройкиТаблицы",СтруктураТаблицы());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция СтруктураТаблицы()
	
	СтруктураТаблицы=Новый Структура();
	
	СтруктураТаблицы.Вставить("Код","СправочникСсылка.Партнеры#Код#15#1#Справочники.Партнеры.НайтиПоКоду(""&Ячейка&"")#Код");
	СтруктураТаблицы.Вставить("Партнер","СправочникСсылка.Партнеры#Партнер#30#1#Справочники.Партнеры.НайтиПоНаименованию(""&Ячейка&"", Истина)#Партнер");
	СтруктураТаблицы.Вставить("Баллы","Число#Баллы#8#1#?(ЗначениеЗаполнено(""&Ячейка&""), ""&Ячейка&"", Неопределено)#Баллы");

	Возврат  СтруктураТаблицы;
	
КонецФункции 

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт
	
    ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры)
	
	Если Не Результат = Неопределено Тогда
		ТаблицаДанных = ПолучитьИзВременногоХранилища(Результат);
				
		Если ТаблицаДанных<>Неопределено Тогда
			ОчищеннаяТД = ТаблицаДанных.СкопироватьКолонки();
			ОчищеннаяТД.Колонки.Добавить("ДоступныеБаллы");
			ОчищеннаяТД.Колонки.Добавить("ДоступныеБаллыБудут");
			Для Каждого СтрТД Из ТаблицаДанных Цикл
				Партнер_ = Неопределено;
				Если ЗначениеЗаполнено(СтрТД.Код) Тогда // если нашли по коду, то этот результат в приоритете
					Партнер_ = СтрТД.Код;
				ИначеЕсли ЗначениеЗаполнено(СтрТД.Партнер) Тогда
					Партнер_ = СтрТД.Партнер;
				КонецЕсли;
				Если ЗначениеЗаполнено(Партнер_) И ЗначениеЗаполнено(СтрТД.Баллы) Тогда
					НоваяСтрока = ОчищеннаяТД.Добавить();
					НоваяСтрока.Партнер = Партнер_;
					НоваяСтрока.Баллы = СтрТД.Баллы;
					СтруктураИнформацииПоБаллам = БонусыАльтерраРезерв.ПолучитьИнформациюПоБаллам(ТекущаяДата(), Партнер_);
					НоваяСтрока.ДоступныеБаллы = СтруктураИнформацииПоБаллам.ДоступныеБаллы;
					НоваяСтрока.ДоступныеБаллыБудут = РассчитатьБаллыБудут(Партнер_, СтруктураИнформацииПоБаллам.ДоступныеБаллы, СтрТД.Баллы);
				КонецЕсли;
			КонецЦикла;
			
			Объект.Начисление.Загрузить(ОчищеннаяТД);
			Объект.Списание.Загрузить(ОчищеннаяТД);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Взаимодействие_С_Битриксом  

&НаКлиенте
Процедура Док_ОтправитьНаУтверждение(Команда)
	Если ИДЭлементаВБитриксеФ = "" Тогда
		Если ЭтаФорма.Модифицированность Тогда
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));    
			
			Если ОтказПриЗаписи Тогда  
				ОтказПриЗаписи = Ложь;
				Возврат;
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если Объект.Комментарий = "" Тогда 
			Если КомментарийОбязателенДляЗаполнения()  Тогда 
				Сообщить("Перед отправкой на утверждение необходимо заполнить комментарий");
				Возврат;
			КонецЕсли;
		КонецЕсли;    
		
		Если Объект.СуммаДокумента = 0 Тогда
			Возврат;
		КонецЕсли;
		
		СоздатьБП_Бонусы(); 		 
	Иначе
		Сообщить("По данному документу уже создан БП " + ИДЭлементаВБитриксеФ);
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере	
Процедура СоздатьБП_Бонусы()
	
	СтруктураБП = ПолучитьСтруктуруБП();
	
	КодЭлементаПроцесса = Строка(Объект.Ссылка.УникальныйИдентификатор());
	
	СтруктураОтвета = АльтерраВзаимодействиеСБитрикс24.ДобавитьНовыйЭлементСписка("lists_socnet", "101", КодЭлементаПроцесса,СтруктураБП);
	
	Если СтруктураОтвета.Свойство("НазваниеОшибки") Тогда
		Сообщить("Ошибка отправки в Битрикс: "+ СтруктураОтвета.ОписаниеОшибки + " (код ошибки = " + СтруктураОтвета.КодСостояния + ")");
		ЗаписьЖурналаРегистрации("Бизнес-Процесс Начисление ББ не создан",
		УровеньЖурналаРегистрации.Ошибка, , ,
		"Ошибка при создании БП в Битрикс по документу № " + Объект.Номер + " от " + Объект.Дата +": " + СтруктураОтвета.ОписаниеОшибки 
		+ " (код ошибки = " + СтруктураОтвета.КодСостояния + ")");
	КонецЕсли;   	
	
	Если СтруктураОтвета.Свойство("Результат") Или СтруктураОтвета.Свойство("result") Тогда   	
		ИДЭлементаВБитриксе = СтруктураОтвета.result;
		ИДЭлементаВБитриксе = СтрЗаменить(ИДЭлементаВБитриксе," ","");
		НаборЗаписейИДБП = РегистрыСведений.Альтерра_ИдентификаторыОбъектовБ24.СоздатьНаборЗаписей();
        НаборЗаписейИДБП.Отбор.Объект.Установить(Объект.Ссылка);
		НаборЗаписейИДБП.Записывать = Истина;
		НоваяЗапись = НаборЗаписейИДБП.Добавить();
		НоваяЗапись.Идентификатор = ИДЭлементаВБитриксе;
		НоваяЗапись.Объект = Объект.Ссылка;
		НаборЗаписейИДБП.Записать();
		
		ИДЭлементаВБитриксеФ = ИДЭлементаВБитриксе;
		
		Сообщить("В Битриксе успешно запущен БП " + ИДЭлементаВБитриксе);
		Элементы.Утверждающий1.ТолькоПросмотр = Истина;
		Попытка 
			Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Элемент Начисление ББ не записан",
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Ошибка при записи документа №" + Объект.Номер + " от " + Объект.Дата +": "+ ИДЭлементаВБитриксе 
			+" " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;	 
		ИзменениеДоступностиФормыДляРедакрирования();
	Иначе
		ЗаписьЖурналаРегистрации("Бизнес-Процесс Начисление ББ", УровеньЖурналаРегистрации.Ошибка, , ,"Ошибка при записи документа №" + Объект.Номер + " от " + Объект.Дата +": "+ "Нет ответа от Битрикс"); 	
	КонецЕсли;
	Элементы.НадписьНельзяРедактировать.Видимость = Не ЗначениеЗаполнено(ИДЭлементаВБитриксеФ);	
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьБП_Бонусы()
	
	//Изменить Эл списка
	СтруктураБП = ПолучитьСтруктуруБП();
	КодЭлементаПроцесса = Строка(Объект.Ссылка.УникальныйИдентификатор());
	
	СтруктураОтвета = АльтерраВзаимодействиеСБитрикс24.ИзменитьЭлементСписка("lists_socnet", "101", КодЭлементаПроцесса,СтруктураБП); 
	Если СтруктураОтвета.Свойство("НазваниеОшибки") Тогда
		Сообщить("Ошибка отправки в Битрикс: "+ СтруктураОтвета.ОписаниеОшибки + " (код ошибки = " + СтруктураОтвета.КодСостояния + ")");
	КонецЕсли;  
	
	
КонецПроцедуры 

функция ПолучитьБизнесПроцессыЭлементаИнфоблока(ИДЭлементаВБитриксе, СтруктураОтбора = Неопределено, СтруктураСортировки = Неопределено, ВернутьСтрокойJSON = Ложь) Экспорт
	
	МассивПолей = Новый Массив;
	МассивПолей.Добавить("ID"); 
	МассивПолей.Добавить("MODULE_ID");
	МассивПолей.Добавить("ENTITY");
	МассивПолей.Добавить("DOCUMENT_ID");
	МассивПолей.Добавить("STARTED");
	МассивПолей.Добавить("STARTED_BY");
	МассивПолей.Добавить("TEMPLATE_ID");
	
	ПараметрыЗапроса = Новый Структура;
	
	ПараметрыЗапроса.Вставить("SELECT", МассивПолей);
	Если СтруктураОтбора  <> Неопределено Тогда
		ПараметрыЗапроса.Вставить("FILTER", структураОтбора);  
	КонецЕсли;  
	Если СтруктураСортировки  <> Неопределено Тогда	
		ПараметрыЗапроса.Вставить("ORDER", СтруктураСортировки); 
	КонецЕсли;
	
	Возврат АльтерраВзаимодействиеСБитрикс24.ВыполнитьПроизвольныйЗапрос("bizproc.workflow.instances", ПараметрыЗапроса, ВернутьСтрокойJSON)["result"];
	
КонецФункции 

&НаСервере
Функция ПолучитьСтруктуруБП()    
	
	Если Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Списание  Тогда
		СтрокаТЧ = Объект.Списание[0];
		ВидПравилаДляБП = "списа";
		СписатьИлиНачислить ="списа";
	ИначеЕсли Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление Тогда 
		СтрокаТЧ = Объект.Начисление[0]; 
		ВидПравилаДляБП = "начисле"; 
		СписатьИлиНачислить ="начисли";
	Иначе   
		Сообщить("Для документов без вида списания не предусмотрено создание БП");
		Возврат "";
	КонецЕсли;	
	
	Клиент = СтрокаТЧ.Партнер;
	
	ИДВидНачисления = ОпределитьИДВидаНачисления();  
	
	Если Объект.Комментарий = "" Тогда
		ПричинаНачисления = "Причина не указана";
	Иначе  
		ПричинаНачисления = Объект.Комментарий;
	КонецЕсли;
	
	СтруктураБП  = Новый Структура(); 

	СтруктураБП.Вставить("NAME", "Заявка на согласование " + ВидПравилаДляБП + "ния бонусов № " + ИДЭлементаВБитриксеФ);
	СтруктураБП.Вставить("CREATED_BY", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Объект.Ответственный));
	СтруктураБП.Вставить("PROPERTY_1341", Клиент.Код );
	СтруктураБП.Вставить("PROPERTY_1342", Клиент.Наименование);
	СтруктураБП.Вставить("PROPERTY_1359", Строка(Объект.СуммаДокумента));
	СтруктураБП.Вставить("PROPERTY_1360", ПричинаНачисления);   // причина начисления
	СтруктураБП.Вставить("PROPERTY_1361", ИДВидНачисления); //вид начисления
	СтруктураБП.Вставить("PROPERTY_3274", ВидПравилаДляБП); //Списание или начисление 
	СтруктураБП.Вставить("PROPERTY_3275", СписатьИлиНачислить); //Списать или начислить
	СтруктураБП.Вставить("PROPERTY_1350", ОпределитьИДСтатуса()); //Статус  
	СтруктураБП.Вставить("PROPERTY_3785","Да");
	
	Если ЗначениеЗаполнено(Объект.Утверждающий1) Тогда
		СтруктураБП.Вставить("PROPERTY_1343", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Объект.Утверждающий1.Пользователь));
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Утверждающий2) Тогда
		СтруктураБП.Вставить("PROPERTY_1344", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Объект.Утверждающий2.Пользователь));
	КонецЕсли;
	
	Если Не ДопМодуль.НужноСогласованиеАналитиков(Объект.Причина) Тогда
		СтруктураБП.Вставить("PROPERTY_3784","Нет" );      
	КонецЕсли;
	Если  ЗначениеЗаполнено(Объект.Документ) Тогда   
		ДокументОснование = Объект.Документ;    
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОбращениеКлиента") Тогда   
			 ИДОбращения = ИДОбращениявБитрикс(ДокументОснование);
			 СтруктураБП.Вставить("PROPERTY_3790", ИДОбращения); 
		КонецЕсли;
	КонецЕсли;	 
	Возврат СтруктураБП;
	
КонецФункции

&НаСервере
Функция ИДОбращениявБитрикс(ДокументОснование)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Альтерра_ИдентификаторыОбъектовБ24.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.Альтерра_ИдентификаторыОбъектовБ24 КАК Альтерра_ИдентификаторыОбъектовБ24
		|ГДЕ
		|	Альтерра_ИдентификаторыОбъектовБ24.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Идентификатор;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции


&НаСервере
Функция  ОпределитьИДВидаНачисления(ПолучитьИД = Истина)
	
	
	Причина = Объект.Причина; 
	
	Если Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Списание бонусов (по бп)") Тогда	
		ИД = "15132"; 
		XML_ID = "3da8eceb3bea91077d02b0a13942b431";	
	ИначеЕсли Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Доначисление (по бп)") Тогда
		ИД = "5387" ; 	 
		XML_ID = "4f01ed202e51c2ba44c0e6d67fae2e62";
	ИначеЕсли	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Неверный ценник (по бп)")Тогда
		ИД = "26303";   
		XML_ID = "8e49a5e3af5dead44325a6b5d14c8644";
	ИначеЕсли 	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Обмен в ТЗ (по БП)") Тогда 
		ИД = "26302"; 
		XML_ID = "44dd93c258c2094271cbab0f7393a07d"
	ИначеЕсли Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("За отзыв (по бп)") Тогда
		ИД = "26304"; 
		XML_ID = "c5e429db75fc09eb9eb8e1858833f3e8"
	ИначеЕсли Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Прочее (по бп)") Тогда 
		ИД = "5418" ;  
		XML_ID = "76123734c7ced5fdad75f5fdc7604915"
	ИначеЕсли Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("По жалобе (по БП)") Тогда
		ИД = "5386"; 
		XML_ID = "0e5f24220fbf0fa69e71fa22c634a5cd"
	Иначе
		ИД = "";
		XML_ID = ""
	КонецЕсли;
	
	Если ПолучитьИД  Тогда	
		Возврат ИД;
	Иначе 
		Возврат XML_ID;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОпределитьИДСтатуса() 
	
	Статус = Объект.Статус;
	
	Если Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.НаСогласовании Тогда	
		ИДСтатуса = "5419" ;
	ИначеЕсли  Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.Согласован Тогда 
		ИДСтатуса = "5420" ;   
	ИначеЕсли  Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.Исполнен Тогда
		ИДСтатуса = "5421" ;   
	ИначеЕсли  Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.Отклонен Тогда
		ИДСтатуса = "5422" ; 
	ИначеЕсли  Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.Доработка Тогда
		ИДСтатуса = "5423" ;  
	Иначе
		ИДСтатуса = "";
	КонецЕсли;  
	
	Возврат ИДСтатуса;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ДопЗаполнение()    
	Если Объект.ПериодДействия = Перечисления.Периодичность.ПустаяСсылка() Тогда 
		Объект.ПериодДействия = Перечисления.Периодичность.Неделя; 
	КонецЕсли;
	Если объект.ПериодОтсрочкиНачалаДействия = Перечисления.Периодичность.ПустаяСсылка() Тогда 
		Объект.ПериодОтсрочкиНачалаДействия = Перечисления.Периодичность.Неделя; 
	КонецЕсли;
	
	Если Объект.Ответственный = Справочники.Пользователи.ПустаяСсылка() ТОгда 
		Объект.Ответственный = ПараметрыСеанса.ТЕкущийПользователь;     
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораРасширенные(СтрокаПоиска)
	
	Возврат Справочники.Партнеры.ПолучитьДанныеВыбора( Новый Структура("СтрокаПоиска, ВводПоСтрокеРасширенный", СтрокаПоиска, Истина));
	
КонецФункции

&НаСервере
Процедура ОчиститьТаблицы()
	Объект.Списание.Очистить();
	Объект.Начисление.Очистить();
	Объект.НачислитьЗаСчет.Очистить();
	Объект.СуммаДокумента = 0; 
	
	Объект.Причина = Справочники.ПричиныНачисленияБонусныхБаллов.ПустаяСсылка();
КонецПроцедуры

&НаСервере
Функция РассчитатьБаллыБудут(Партнер, ДоступныеБаллы, Баллы)
	
	Будут = Неопределено;
	Если Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление Тогда
		Будут = ДоступныеБаллы + Баллы;
	ИначеЕсли Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Списание Тогда
		Будут = ДоступныеБаллы - Баллы;
	Иначе
		Сообщить("Вариант расчета бонусных баллов документа не подходит для ручной корректировки данных");
		Возврат Неопределено;
	КонецЕсли;
	Если Будут < 0 Тогда Сообщить("Баланс Партнера " + Партнер + " станет отрицательным"); КонецЕсли;
	Возврат Будут;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьБаллыПоТекущейСтрокеСписания()
	
	Партнер = Элементы.Списания.ТекущиеДанные.Партнер;
	Если ЗначениеЗаполнено(Партнер) Тогда
		СтруктураИнформацииПоБаллам = БонусыАльтерраРезерв.ПолучитьИнформациюПоБаллам(ТекущаяДата(), Партнер);
		Элементы.Списания.ТекущиеДанные.ДоступныеБаллы = СтруктураИнформацииПоБаллам.ДоступныеБаллы;
		Элементы.Списания.ТекущиеДанные.ДоступныеБаллыБудут = РассчитатьБаллыБудут(Партнер, СтруктураИнформацииПоБаллам.ДоступныеБаллы, Элементы.Списания.ТекущиеДанные.Баллы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьБаллыПоТекущейСтрокеНачисления()
	
	Партнер = Элементы.Начисления.ТекущиеДанные.Партнер;
	Если ЗначениеЗаполнено(Партнер) Тогда
		СтруктураИнформацииПоБаллам = БонусыАльтерраРезерв.ПолучитьИнформациюПоБаллам(ТекущаяДата(), Партнер);
		Элементы.Начисления.ТекущиеДанные.ДоступныеБаллы = СтруктураИнформацииПоБаллам.ДоступныеБаллы;
		Элементы.Начисления.ТекущиеДанные.ДоступныеБаллыБудут = РассчитатьБаллыБудут(Партнер, СтруктураИнформацииПоБаллам.ДоступныеБаллы, Элементы.Начисления.ТекущиеДанные.Баллы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарийВПартнераНаСервере(Комментарий_, Партнер)
	ПартнерОбъект = Партнер.ПолучитьОбъект();
	ПартнерОбъект.Комментарий = ПартнерОбъект.Комментарий + Символы.ПС + Комментарий_;
	ПартнерОбъект.ОбменДанными.Загрузка = Истина;
	ПартнерОбъект.Записать();
КонецПроцедуры


//Автоматизация ББ
&НаСервере
Процедура ИзменениеДоступностиФормыДляРедакрирования()
	
   ЭтаФорма.ТолькоПросмотр = Ложь;
	Если  НЕ (Объект.Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.НаСогласовании И ИДЭлементаВБитриксеФ = "") Тогда
		ЭтаФорма.ТолькоПросмотр = НЕ ДопМодуль.РольДоступнаОтделАналитики(); 
	КонецЕсли;
	Элементы.ИДЭлементаВБитриксе.ТолькоПросмотр = Не РольДоступна("ПолныеПрава");
КонецПроцедуры

&НаСервере

&НаСервере
Функция ПолучитьМассивПричинНачисления() 
	
	МассивЗначений = Новый Массив;
	ТипДокумента = ТипЗнч(Объект.Документ);  
	
	Если Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление Тогда
		Если ТипДокумента = Тип("ДокументСсылка.ОбращениеКлиента") Тогда
			
			МассивЗначений.Добавить(Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("По жалобе (по БП)")); 
			
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или  ТипДокумента = Тип("ДокументСсылка.ЧекККМ") Тогда   
			
			МассивЗначений.Добавить(Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Доначисление (по бп)")); 
			МассивЗначений.Добавить(Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Неверный ценник (по бп)"));  
			
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПересчетТоваров") Тогда 
			
			МассивЗначений.Добавить(Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Обмен в ТЗ (по БП)")); 
			
		Иначе
			Если РольДоступна("ОтделРекламы") Или РольДоступна("ОтделАналитики") Или РольДоступна("ПолныеПрава")  Тогда
				МассивЗначений.Добавить(Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("За отзыв (по бп)"));
			КонецЕсли;
			МассивЗначений.Добавить(Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Прочее (по бп)")); 
		КонецЕсли;
		
	ИначеЕсли  Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Списание Тогда
		МассивЗначений.Добавить(Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Списание бонусов (по бп)")); 
	КонецЕсли;	
	
	Возврат МассивЗначений;  
	
КонецФункции

&НаСервере
Процедура УстановитьПричинуСписание()
	Объект.Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Списание бонусов (по бп)");
КонецПроцедуры

&НаСервере
Функция ОчиститьУтверждающего3()
	Объект.Утверждающий3 = Справочники.Сотрудники.ПустаяСсылка();
КонецФункции


&НаКлиенте
Процедура Док_БонусныеБаллыПартнерПриИзмененииПеред(Элемент) 
	ПроверитьПартнера("Начисление");	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьПартнера(ИмяТабЧасти)  
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");     
	
	Если Не ДокументОбъект.КлиентуМожноНачислятьББ(Объект[ИмяТабЧасти][0].Партнер) Тогда   
		Объект[ИмяТабЧасти][0].Партнер = Справочники.Партнеры.ПустаяСсылка();
		ВызватьИсключение "Выбранный клиент не является ни Частным лицом,ни Бригадиром! Для таких клиентов не предусмотрено участие в Бонусной программе.";
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция  КомментарийОбязателенДляЗаполнения() 
	
	Если Объект.Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("За отзыв (по бп)") 
		Или Объект.Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Прочее (по бп)") 	
		Или Объект.Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Списание бонусов (по бп)") Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	 Возврат Ложь;     
	 
КонецФункции

&НаСервере
Процедура НастройкиВидимостиСОснованием(ОтделАналитики) 
		
		Элементы.ГруппаПравилоНачисления.ТолькоПросмотр  = Не ОтделАналитики;
		Элементы.МаркетинговоеМероприятие.ТолькоПросмотр = Не ОтделАналитики; 
		
		Если Объект.Документ = Тип("ДокументСсылка.ОбращениеКлиента") 
			Или Объект.Документ = Тип("ДокументСсылка.ПересчетТоваров") Тогда  
			Элементы._Причина.ТолькоПросмотр = Не ОтделАналитики;
		КонецЕсли;
				
	КонецПроцедуры

	
&НаСервере
Функция ПолучитьИДЭлементаВБитриксе()
	НаборЗаписей = РегистрыСведений.Альтерра_ИдентификаторыОбъектовБ24.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() <> 0  Тогда
		Запись = НаборЗаписей.Получить(0);
	Иначе
		возврат Неопределено;
	КонецЕсли;
	Если Запись <> Неопределено Тогда
		возврат Запись.Идентификатор;
	Иначе
		возврат Неопределено;
	КонецЕсли
КонецФункции
